; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem satellite-41)
 (:domain satellite)
 (:objects 
    sat1 sat2 sat3 sat4 sat5 - satellite
    ins1 ins2 ins3 ins4 ins5 ins6 ins7 ins8 ins9 - instrument
    mod1 mod2 - mode
    dir1 dir2 dir3 dir4 dir5 dir6 - direction
    )
 (:init 
    (pointing sat1 dir5)
    (pointing sat2 dir5)
    (pointing sat3 dir1)
    (pointing sat4 dir3)
    (pointing sat5 dir1)
    (power_avail sat1)
    (power_avail sat2)
    (power_avail sat3)
    (power_avail sat4)
    (power_avail sat5)
    (calibration_target ins1 dir3)
    (calibration_target ins2 dir2)
    (calibration_target ins3 dir2)
    (calibration_target ins4 dir3)
    (calibration_target ins5 dir1)
    (calibration_target ins6 dir4)
    (calibration_target ins7 dir4)
    (calibration_target ins8 dir5)
    (calibration_target ins9 dir3)
    (on_board ins1 sat1)
    (on_board ins2 sat3)
    (on_board ins3 sat5)
    (on_board ins4 sat2)
    (on_board ins5 sat4)
    (on_board ins6 sat5)
    (on_board ins7 sat5)
    (on_board ins8 sat1)
    (on_board ins9 sat5)
    (supports ins6 mod1)
    (supports ins8 mod1)
    (supports ins7 mod2)
    (supports ins3 mod2)
    (supports ins9 mod2)
    (supports ins5 mod1)
    (supports ins1 mod1)
    (supports ins6 mod2)
    (supports ins7 mod1)
    (supports ins9 mod1)
    (supports ins2 mod2)
    (supports ins4 mod1))
 (:goal (and 
(have_image dir1 mod1)
(have_image dir2 mod1)
(have_image dir3 mod1)
(have_image dir5 mod1)
(have_image dir6 mod1)
(pointing sat1 dir6)
(have_image dir1 mod2)
(have_image dir2 mod2)
(have_image dir3 mod2)
(pointing sat3 dir1)
(pointing sat4 dir6)
))
)

; plan
1. (turn_to sat4 dir6 dir3)
   deleted: (pointing sat4 dir3)
   added: (pointing sat4 dir6)
   goals met: 2 of 11
2. (switch_on ins8 sat1)
   deleted: (power_avail sat1)
   added: (power_on ins8)
   goals met: 2 of 11
3. (calibrate sat1 ins8 dir5)
   added: (calibrated ins8)
   goals met: 2 of 11
4. (take_image sat1 dir5 ins8 mod1)
   added: (have_image dir5 mod1)
   goals met: 3 of 11
5. (turn_to sat1 dir6 dir5)
   deleted: (pointing sat1 dir5)
   added: (pointing sat1 dir6)
   goals met: 4 of 11
6. (switch_on ins9 sat5)
   deleted: (power_avail sat5)
   added: (power_on ins9)
   goals met: 4 of 11
7. (turn_to sat5 dir3 dir1)
   deleted: (pointing sat5 dir1)
   added: (pointing sat5 dir3)
   goals met: 4 of 11
8. (calibrate sat5 ins9 dir3)
   added: (calibrated ins9)
   goals met: 4 of 11
9. (take_image sat5 dir3 ins9 mod1)
   added: (have_image dir3 mod1)
   goals met: 5 of 11
10. (take_image sat5 dir3 ins9 mod2)
   added: (have_image dir3 mod2)
   goals met: 6 of 11
11. (turn_to sat5 dir1 dir3)
   deleted: (pointing sat5 dir3)
   added: (pointing sat5 dir1)
   goals met: 6 of 11
12. (take_image sat5 dir1 ins9 mod1)
   added: (have_image dir1 mod1)
   goals met: 7 of 11
13. (take_image sat5 dir1 ins9 mod2)
   added: (have_image dir1 mod2)
   goals met: 8 of 11
14. (turn_to sat5 dir2 dir1)
   deleted: (pointing sat5 dir1)
   added: (pointing sat5 dir2)
   goals met: 8 of 11
15. (take_image sat5 dir2 ins9 mod1)
   added: (have_image dir2 mod1)
   goals met: 9 of 11
16. (take_image sat5 dir2 ins9 mod2)
   added: (have_image dir2 mod2)
   goals met: 10 of 11
17. (take_image sat1 dir6 ins8 mod1)
   added: (have_image dir6 mod1)
   goals met: 11 of 11
